a:A WEEK 7/W7D5/redditClone/app/views/subs/show.html.erb


<% posts = Post.where("sub_id = ?", @sub.id)%>
---
SELECT "posts".* FROM "posts" WHERE (sub_id = 1)