a:A WEEK 6/W6D3/first_routes_controllers/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 5], ["LIMIT", 1]]
---
  def index
    @artworks = Artwork.find_by(artist_id: params[:user_id])

INSERT INTO "artworks" ("title", "image_url", "artist_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Snoop-dog"], ["image_url", "whhatt"], ["artist_id", 10]]
---
  def create
    @artwork = Artwork.new(artwork_params)
    if @artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    @artwork = Artwork.find_by(id: params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1 WHERE "artworks"."id" = $2  [["title", "Jay-Z"], ["id", 23]]
---
  def update
    @artwork = Artwork.find_by(id: params[:id])
    if @artwork
      @artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 19]]
---
  def destroy
    @artwork = Artwork.find_by(id: params[:id])
    if @artwork
      @artwork.destroy