a:A WEEK 6/W6D3/first_routes_controllers/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 2]]
---
  def create
    @artwork_share = ArtworkShare.new(artwork_share_params)
    if @artwork_share.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 1]]
---
  def destroy
    @artwork_share = ArtworkShare.find_by(id: params[:id])
    if @artwork_share
      @artwork_share.destroy