a:A WEEK 6/W6D3/first_routes_controllers/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"
---
  def index
    if params[:user_id]
      @comments = Comment.find_by(user_id: params[:user_id])
    elsif params[:artwork_id]
      @comments = Comment.find_by(artwork_id: params[:artwork_id])
    elsif params[:user_id].nil? && params[:artwork_id].nil?
      @comments = Comment.all