a:A WEEK 6/W6D3/first_routes_controllers/app/controllers/users_controller.rb

  def index
    if params[:username]
      @users = User.find_by(username: params[:username])
    else
      @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "radio_man"], ["LIMIT", 1]]
SELECT "users".* FROM "users"

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name") VALUES ($1) RETURNING "id"  [["name", "Darrick"]]

  def update
    user = User.find_by(id: params[:id])
    if user
      user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "Billy"], ["email", "\"billy@io\""], ["id", 1]]

  def destroy
    user = User.find_by(id: params[:id])
    if user
      user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 2]]