a:A WEEK 7/W7D5/redditClone/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "url", "content", "sub_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "hey"], ["url", "www"], ["content", "testing"], ["sub_id", 1], ["user_id", 1], ["created_at", "2021-08-20 18:26:17.422012"], ["updated_at", "2021-08-20 18:26:17.422012"]]
---
    def create
        @post = Post.create(post_params)
        @post.user_id = current_user.id

        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "url" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["url", "google"], ["content", "go to goggle"], ["updated_at", "2021-08-20 18:37:54.143269"], ["id", 3]]
---
    def update
        @post = Post.find_by(id: params[:id])
        if @post && @post.user_id == current_user.id
            @post.update(post_params)