a:A WEEK 7/W7D5/redditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "123456"], ["description", "123456"], ["user_id", 1], ["created_at", "2021-08-20 17:26:39.513341"], ["updated_at", "2021-08-20 17:26:39.513341"]]
---
    def create
        @sub = Sub.create(sub_params)
        @sub.user_id = @current_user.id
        if @sub.save

SELECT  "subs".* FROM "subs" WHERE "subs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "description" = ?, "updated_at" = ? WHERE "subs"."id" = ?  [["description", "123456adsf"], ["updated_at", "2021-08-20 17:33:45.220256"], ["id", 1]]
---
    def update
        @sub = Sub.find_by(id: params[:id])
        if @sub && @sub.user_id == @current_user.id
            @sub.update(sub_params)