a:A WEEK 7/W7D5/redditClone/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "WqypJ8b9OMoJY_cK98W5tA"], ["updated_at", "2021-08-20 16:45:10.447119"], ["id", 2]]