a:A WEEK 7/W7D5/redditClone/app/views/posts/new.html.erb

    <input type="hidden" name="post[sub_id][]" value="">
    <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"