a:A WEEK 7/W7D5/redditClone/app/models/user.rb

def self.find_by_credential(username,password)
  user = User.find_by(username:username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Bravo"], ["LIMIT", 1]]

def reset_session_token
  self.session_token = SecureRandom::urlsafe_base64
  self.save
---
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "WqypJ8b9OMoJY_cK98W5tA"], ["updated_at", "2021-08-20 16:45:10.447119"], ["id", 2]]