a:A WEEK 7/W7D2/musicApp/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "kqkNyXXOyiOldPMo1DsVFg"], ["updated_at", "2021-08-17 22:44:07.059351"], ["id", 1]]
---
  def reset_session_token
    self.session_token = User.generate_session_token
    self.save!